# MARK: - Taps
tap "homebrew/bundle"
tap "noborus/tap"

# MARK: - CLI
# ANCHOR: ls
brew "eza" # ls
# brew "lsd" # ls
# ANCHOR: cd
brew "broot"
brew "walk"
brew "zoxide" # cd
# ANCHOR: find
brew "fd" # find
brew "fzf"
brew "sk"
# ANCHOR: File
brew "bat" # cat
brew "duf" # df
brew "dua-cli" # du
brew "dust" # du
brew "git-delta" # diff
brew "noborus/tap/ov" # more
brew "ripgrep" # grep
brew "sd" # sed
brew "cheat" # man
brew "tldr" # man
# ANCHOR: Process
brew "bottom" # top
brew "glances" # top
brew "procs" # ps
# ANCHOR: Network
brew "bandwhich"
brew "doggo" # dig
brew "unbound"
# ANCHOR: Utility
brew "fastfetch"
brew "grex" # for generating regular expressions
brew "neovim"
brew "onefetch" # for git
brew "sevenzip"
brew "tokei"

# MARK: - Browsers
cask "firefox"
cask "firefox@developer-edition"
cask "librewolf", args: { no_quarantine: true }
cask "zen-browser"
# cask "chromium" # replaced by eloston-chromium
cask "eloston-chromium", greedy: true
cask "google-chrome"
cask "vivaldi"
cask "brave-browser"
cask "naver-whale"

# MARK: - Terminal
brew "starship"
brew "zsh"
# cask "iterm2"
# cask "cool-retro-term"
# cask "alacritty"
# cask "hyper"
cask "tabby"
# cask "wezterm"
cask "warp"
cask "ghostty"
cask "wave"
cask "amazon-q"

# MARK: - Development
# ANCHOR: Git
# brew "act"
brew "git"
brew "gh"
cask "fork"
cask "github"
# cask "gitkraken"
# cask "sourcetree"
# ANCHOR: Python
# brew "pipx" # replaced by uv
# brew "poetry"
# brew "pyenv"
# brew "pyenv-virtualenv"
# brew "uv"
# ANCHOR: Node.js
# brew "deno"
# brew "fnm"
# brew "volta"
# brew "oven-sh/bun/bun"
# ANCHOR: Languages
brew "go"
brew "rustup"
# ANCHOR: IDE
cask "visual-studio-code"
cask "visual-studio-code@insiders"
cask "zed"
cask "cursor"
cask "dbeaver-community"
cask "jetbrains-toolbox"
# ANCHOR: Docker
# brew "docker" # replaced by orbstack
cask "orbstack"
# ANCHOR: API
cask "bruno"
cask "insomnia"
cask "postman"
# ANCHOR: Tools
brew "libpq", link: true
brew "mise"
brew "scrcpy"
cask "boop"
cask "devtoys"
cask "heynote"
# ANCHOR: JDK
# cask "liberica-jdk21-full"
# cask "temurin@21" unless system "/usr/libexec/java_home", "--failfast"
# cask "zulu@21"
# ANCHOR: SDK
# brew "awscli"
# brew "flyctl"
# cask "android-platform-tools"
# cask "google-cloud-sdk", postinstall: "${HOMEBREW_PREFIX}/bin/gcloud components update"

# MARK: - Security
brew "gnupg"
brew "pinentry-mac"
# cask "gpg-suite"
# cask "keepassxc"

# MARK: - Productivity
cask "chatgpt"
cask "claude"
cask "deepl"
cask "notion"
cask "obsidian"
cask "rize"

# MARK: - Messaging
cask "slack"
cask "discord"
cask "telegram"

# MARK: - Utility
cask "raycast"
cask "rectangle"
cask "stats"
cask "jordanbaird-ice"
cask "appcleaner"
cask "keka"
cask "omnidisksweeper"
cask "sloth", args: { no_quarantine: true }
cask "gureumkim"

# MARK: - Design
cask "figma"
# cask "gimp"
# cask "inkscape"

# MARK: - Media
cask "iina"
cask "vlc"
# cask "handbrake"
# cask "kid3"
# cask "mediainfo"
# cask "xnconvert"
# cask "xnviewmp"
cask "zoom"

# MARK: - Fonts
# cask "font-d2coding"
# cask "font-nanum-brush-script"
# cask "font-nanum-gothic"
# cask "font-nanum-myeongjo"
# cask "font-nanum-pen-script"
cask "font-noto-color-emoji"
cask "font-noto-emoji"
cask "font-noto-sans-cjk-kr"
cask "font-noto-sans-kr"
cask "font-noto-sans-mono-cjk-kr"
cask "font-noto-serif-cjk-kr"
cask "font-noto-serif-kr"
# cask "font-pretendard"
cask "font-departure-mono-nerd-font"
cask "font-symbols-only-nerd-font"
